//KyoukiCardの定義（名前, トリガー, 効果）
var KyoukiCard = function(name, trigger, effect) {
  this.name = name;
  this.trigger = trigger;
  this.effect = effect;
};
KyoukiCard.prototype.toString=function() {
  return "狂気：" + this.name + "\n"
      + "------------------------------" + "\n"
      + "トリガー：" + this.trigger + "\n"
      + "------------------------------" + "\n"
      + this.effect;
};
KyoukiCard.prototype.alert=function() {
  alert(this.toString());
};
//KyoukiCardオブジェクトのクローン作成
function cloneObj(obj) {
  return new KyoukiCard(obj.name, obj.trigger, obj.effect);
}

//狂気カード（基本ルルブ・デッドループ）
var c0 = new KyoukiCard("疑心暗鬼",
                        "同じシーンにいる自分以外のキャラクターがファンブルする。",
                        "　周囲の人物に対して疑惑が高まる。誰かがあなたを裏切っている！\n　この【狂気】が顕在化したシーンに登場している自分以外のＰＣの中から一人を選び、2点のダメージを与える。");
var c1 = new KyoukiCard("広がる恐怖",
                        "同じシーンにいる誰か（自分も含む）がファンブルする",
                        "　あなたは、何もかもが怖くなっている。\n　自分の【恐怖心】の特技1つを選ぶ。その上下左右の位置にある特技も【恐怖心】として扱う。");
var c2 = new KyoukiCard("依存",
                        "自分が「鎮痛剤」を使用する。",
                        "　あなたは痛みに耐えられない。\n　セッションが終了するまで、自分がシーンプレイヤーのシーンで自分の【生命力】か【正気度】が1点以上減少している場合、持っていたら必ず「鎮痛剤」を使用すること。");
var c3 = new KyoukiCard("疎外感",
                        "同じシーンに自分以外のPCが登場していない。",
                        "　みんながあなたを嫌っているような妄想にかられる。\n　次に恐怖判定に失敗すると、自分で自分に1D6点のダメージを与える(一回のみ)。");
var c4 = new KyoukiCard("挙動不審",
                        "自分が怪異によってダメージを受ける。",
                        "　あなたは、怪物から何かを伝染されたり、埋め込まれたという妄想にとりつかれている。\n　セッション終了時まで、調査判定と感情判定にマイナス1の修正がつく。");
var c5 = new KyoukiCard("盲目",
                        "自分が恐怖判定を行う。",
                        "　あなたの心は、これ以上怖いものを見るのを拒絶している。\n　自分が新たに【狂気】を公開するまで、調査判定と命中判定にマイナス2の修正がつく。");
var c6 = new KyoukiCard("言葉を失う",
                        "誰かが自分に対するマイナスの【感情】を獲得する。",
                        "　あなたは、強い敵意を感じた。誰かと話すのが怖い。\n　自分が新たに【狂気】を公開するまで、自分が「情報共有」によって【情報】を獲得できなくなり、ドラマシーンで誰かに自発的に【情報】を渡すことができなくなる。");
var c7 = new KyoukiCard("パニック",
                        "自分がダメージを受ける。",
                        "　あなたは、暴力が恐ろしい。戦闘になると、その心はひどく動揺してしまう。\n　自分が新たに【狂気】を公開するまで、戦闘中のファンブル値が1上昇する。");
var c8 = new KyoukiCard("いきすぎた想い",
                        "自分が誰かに対して【感情】を獲得する。",
                        "　自分の中の気持ちが爆発しそうだ。\n　この【狂気】が顕在化したシーンに登場している自分以外のＰＣ全員が、情動の分野からランダムに特技一つを選び、恐怖判定を行う。");
var c9 = new KyoukiCard("血への渇望",
                        "自分が誰かにダメージを与える。",
                        "　あなたは思う存分、残虐に振る舞いたいと思っている。\n　この【狂気】が顕在化したシーンに登場している自分以外のＰＣ全員が、暴力の分野からランダムに特技一つを選び、恐怖判定を行う。");
var c10 = new KyoukiCard("フェティッシュ",
                        "トリガー：自分が感情判定の目標になる。",
                        "　あなたは人造物への偏愛に目覚める。この新しい愛の形をみんなにも知って欲しい。\n　この【狂気】が顕在化したシーンに登場している自分以外のＰＣ全員が、技術の分野からランダムに特技一つを選び、恐怖判定を行う。");
var c11 = new KyoukiCard("絶叫",
                        "自分が恐怖判定に失敗する。",
                        "　事件の恐怖があなたをさいなむ。また何かあれば、恐ろしい絶叫をあげてしまうだろう。\n　この【狂気】が顕在化したシーンに登場している自分以外のＰＣ全員が、知覚の分野からランダムに特技一つを選び、恐怖判定を行う。");
var c12 = new KyoukiCard("怪物",
                        "自分がファンブルする。",
                        "　あなたには、怪物的な一面がある。これを知られるわけにはいかないが……。\n　この【狂気】が顕在化したシーンに登場している自分以外のＰＣ全員が、怪異の分野からランダムに特技一つを選び、恐怖判定を行う。");
var c13 = new KyoukiCard("異言",
                        "自分が感情判定の目標になる。",
                        "　あなたは、大宇宙の残酷な真実を知っている。これをみんなに話したいのだが……。\n　この【狂気】が顕在化したシーンに登場している自分以外のＰＣ全員が、知識の分野からランダムに特技一つを選び、恐怖判定を行う。");
var c14 = new KyoukiCard("記憶喪失",
                        "自分の【正気度】が減少する。",
                        "　あなたは、忘れたくて仕方のない辛い経験をしたようだ。\n　自分の【秘密】と自分の【居所】以外の【情報】を全て失う。");
var c15 = new KyoukiCard("現実逃避",
                        "自分の【正気度】が減少する。",
                        "　あなたは、現実から逃げ出したくてたまらない。\n　自分が新たに【狂気】を公開するまで、自分の【正気度】が1点以上減少している場合、自分がシーンプレイヤーのときに回復判定以外の主要な行動を行うことができない。");
var c16 = new KyoukiCard("闇からの祝福",
                        "自分が恐怖判定に失敗する。",
                        "　常人ならざる不思議な直感があなたを直撃する。\n　好きなキャラクター一人を選んで、そのキャラクターの【情報】一つを獲得できる（この【情報】の獲得には、情報共有が発生しない）。");
var c17 = new KyoukiCard("多重人格",
                        "自分の【正気度】が減少する。",
                        "　もう一つの人格が囁きかける。\n　ＧＭは、この【狂気】が顕在化したシーンの終了後、マスターシーンを挿入し、自由にこのキャラクターの行動を描写できる。マスターシーンが終了したら、ＧＭはこのキャラクターに対して【感情】を持っているキャラクター一人を選び、その【感情】を好きなものに変更するか、そのキャラクターに2点のダメージを与えることができる。");
var c18 = new KyoukiCard("潔癖",
                        "自分が感情判定の目標になる。",
                        "　他人に触れられるのが怖い！\n　自分が新たに【狂気】を公開するまで、ドラマシーンにアイテムの受け渡しを行うことができなくなる。");
var c19 = new KyoukiCard("恐怖症",
                        "自分が恐怖判定に失敗する。",
                        "　それを見るのも触るのも耐えられない。\n　自分が新たに【狂気】を公開するまで、【恐怖心】に指定されている特技が使用不能になる。");
var c20 = new KyoukiCard("失踪",
                        "自分が判定にファンブルする。もしくは、自分が戦闘で敗者になる。",
                        "　ここは自分のいるべき場所じゃない。\n　この【狂気】が顕在化したシーンが終ってから、2シーンの間、自分がシーンプレイヤーではないシーンに登場することができなくなる(マスターシーンには登場可能)。");
var c21 = new KyoukiCard("異性への恐怖",
                        "そのシーンに、自分が異性のキャラクターと二人きりになる。",
                        "　異性が怖い。あいつらは怪物だ！\n　この【狂気】が顕在化したシーンに登場している異性キャラクターの中から、ランダムにキャラクターを選び、2点のダメージを与える。");
var c22 = new KyoukiCard("暴力衝動",
                        "自分と同じシーンにいるキャラクター（自分も含む）がダメージを受ける。",
                        "　血だ！とにかくお前は誰かを傷つけたい。\n　この【狂気】が顕在化したシーンに登場している好きなＰＣの中から一人を選び、1点のダメージを与える。");
var c23 = new KyoukiCard("狂信者",
                        "誰かが自分に対するマイナスの【感情】を獲得する。",
                        "　運命の出会いが間近に迫っていることを感じる。\n　この【狂気】が顕在化したシーンに登場しているキャラクターの中からランダムに一人を選ぶ。そのキャラクターに対して「狂信」の【感情】を獲得する。以降、「狂信」を持っている相手を攻撃するたび、自分の【正気度】が1点減少する。");
var c24 = new KyoukiCard("超現実主義",
                        "自分が恐怖判定に成功する。",
                        "　あなたは怪異を恐れるあまり、その存在を異常なまでに否定している。\n　自分が新たに【狂気】を公開するまで、怪異からの攻撃に対して回避判定を行うことができなくなる。");
var c25 = new KyoukiCard("陰謀論",
                        "自分が調査判定の目標になる。",
                        "　あなたは何者かに監視されている。この国家的陰謀をみんなに教えなければ……。\n　この【狂気】が顕現化したシーンに登場しているＰＣの中から、ランダムに一人を選び、そのキャタクターの【正気度】が1点減少する。");
var c26 = new KyoukiCard("蛮勇",
                        "自分が戦闘に勝利する。",
                        "　急に強い自信と自負が膨らんでくる。敵に背を見せるなど、負け犬のすることだ！\n　自分が新たに【狂気】を公開するまで、戦闘から自発的に脱落することができなくなる。");
var c27 = new KyoukiCard("頑迷",
                        "同じシーンにいる誰か（自分も含む）がファンブルする。",
                        "　自動車やラジオのような新しい技術に不信感が生まれる。\n　以降、知識分野の特技を指定された判定は、マイナス2の修正がつく。");
var c28 = new KyoukiCard("吸血鬼妄想",
                        "自分と同じシーンにいる自分以外のキャラクターがダメージを受ける。",
                        "　あなたは吸血鬼に憧れている。あのしたたる血潮を舐めとりたい。\n　以降、このキャラクターを感情判定の目標にしたり、このキャラクターが感情判定の目標にしたキャラクターは、【生命力】が1点減少する。");
var c29 = new KyoukiCard("迷信",
                        "自分が怪異に関する恐怖判定を行う。",
                        "　あなたはオカルトに熱狂し、傾倒している。\n　以降、知識分野の特技を指定された判定は、マイナス2の修正がつく。");
var c = new KyoukiCard("",
                        "",
                        "");

var cl1Arr = [c0, c1, c2, c3, c4, c5, c6, c7, c8, c9, c10, c11, c12, c13, c14, c15, c16, c17, c18, c19, c20, c21, c22, c23, c24, c25, c26, c27, c28, c29];
