//KyoukiCardの定義（名前, トリガー, 効果）
var KyoukiCard = function(name, trigger, effect) {
  this.name = name;
  this.trigger = trigger;
  this.effect = effect;
};
KyoukiCard.prototype.toString=function() {
  return "狂気：" + this.name + "\n"
      + "------------------------------" + "\n"
      + "トリガー：" + this.trigger + "\n"
      + "------------------------------" + "\n"
      + this.effect;
};
KyoukiCard.prototype.alert=function() {
  alert(this.toString());
};
//KyoukiCardオブジェクトのクローン作成
function cloneObj(obj) {
  return new KyoukiCard(obj.name, obj.trigger, obj.effect);
}

//狂気カード（基本ルルブ・デッドループ）
var c0 = new KyoukiCard("疑心暗鬼",
                        "同じシーンにいる自分以外のキャラクターがファンブルする。",
                        "　周囲の人物に対して疑惑が高まる。誰かがあなたを裏切っている！\n　この【狂気】が顕在化したシーンに登場している自分以外のＰＣの中から一人を選び、2点のダメージを与える。");
var c1 = new KyoukiCard("広がる恐怖",
                        "同じシーンにいる誰か（自分も含む）がファンブルする",
                        "　あなたは、何もかもが怖くなっている。\n　自分の【恐怖心】の特技1つを選ぶ。その上下左右の位置にある特技も【恐怖心】として扱う。");
var c2 = new KyoukiCard("依存",
                        "自分が「鎮痛剤」を使用する。",
                        "　あなたは痛みに耐えられない。\n　セッションが終了するまで、自分がシーンプレイヤーのシーンで自分の【生命力】か【正気度】が1点以上減少している場合、持っていたら必ず「鎮痛剤」を使用すること。");
var c3 = new KyoukiCard("疎外感",
                        "同じシーンに自分以外のPCが登場していない。",
                        "　みんながあなたを嫌っているような妄想にかられる。\n　次に恐怖判定に失敗すると、自分で自分に1D6点のダメージを与える(一回のみ)。");
var c4 = new KyoukiCard("挙動不審",
                        "自分が怪異によってダメージを受ける。",
                        "　あなたは、怪物から何かを伝染されたり、埋め込まれたという妄想にとりつかれている。\n　セッション終了時まで、調査判定と感情判定にマイナス1の修正がつく。");
var c5 = new KyoukiCard("盲目",
                        "自分が恐怖判定を行う。",
                        "　あなたの心は、これ以上怖いものを見るのを拒絶している。\n　自分が新たに【狂気】を公開するまで、調査判定と命中判定にマイナス2の修正がつく。");
var c6 = new KyoukiCard("言葉を失う",
                        "誰かが自分に対するマイナスの【感情】を獲得する。",
                        "　あなたは、強い敵意を感じた。誰かと話すのが怖い。\n　自分が新たに【狂気】を公開するまで、自分が「情報共有」によって【情報】を獲得できなくなり、ドラマシーンで誰かに自発的に【情報】を渡すことができなくなる。");
var c7 = new KyoukiCard("パニック",
                        "自分がダメージを受ける。",
                        "　あなたは、暴力が恐ろしい。戦闘になると、その心はひどく動揺してしまう。\n　自分が新たに【狂気】を公開するまで、戦闘中のファンブル値が1上昇する。");
var c8 = new KyoukiCard("いきすぎた想い",
                        "自分が誰かに対して【感情】を獲得する。",
                        "　自分の中の気持ちが爆発しそうだ。\n　この【狂気】が顕在化したシーンに登場している自分以外のＰＣ全員が、情動の分野からランダムに特技一つを選び、恐怖判定を行う。");
var c9 = new KyoukiCard("血への渇望",
                        "自分が誰かにダメージを与える。",
                        "　あなたは思う存分、残虐に振る舞いたいと思っている。\n　この【狂気】が顕在化したシーンに登場している自分以外のＰＣ全員が、暴力の分野からランダムに特技一つを選び、恐怖判定を行う。");
var c10 = new KyoukiCard("フェティッシュ",
                        "トリガー：自分が感情判定の目標になる。",
                        "　あなたは人造物への偏愛に目覚める。この新しい愛の形をみんなにも知って欲しい。\n　この【狂気】が顕在化したシーンに登場している自分以外のＰＣ全員が、技術の分野からランダムに特技一つを選び、恐怖判定を行う。");
var c11 = new KyoukiCard("絶叫",
                        "自分が恐怖判定に失敗する。",
                        "　事件の恐怖があなたをさいなむ。また何かあれば、恐ろしい絶叫をあげてしまうだろう。\n　この【狂気】が顕在化したシーンに登場している自分以外のＰＣ全員が、知覚の分野からランダムに特技一つを選び、恐怖判定を行う。");
var c12 = new KyoukiCard("怪物",
                        "自分がファンブルする。",
                        "　あなたには、怪物的な一面がある。これを知られるわけにはいかないが……。\n　この【狂気】が顕在化したシーンに登場している自分以外のＰＣ全員が、怪異の分野からランダムに特技一つを選び、恐怖判定を行う。");
var c13 = new KyoukiCard("異言",
                        "自分が感情判定の目標になる。",
                        "　あなたは、大宇宙の残酷な真実を知っている。これをみんなに話したいのだが……。\n　この【狂気】が顕在化したシーンに登場している自分以外のＰＣ全員が、知識の分野からランダムに特技一つを選び、恐怖判定を行う。");
var c14 = new KyoukiCard("記憶喪失",
                        "自分の【正気度】が減少する。",
                        "　あなたは、忘れたくて仕方のない辛い経験をしたようだ。\n　自分の【秘密】と自分の【居所】以外の【情報】を全て失う。");
var c15 = new KyoukiCard("現実逃避",
                        "自分の【正気度】が減少する。",
                        "　あなたは、現実から逃げ出したくてたまらない。\n　自分が新たに【狂気】を公開するまで、自分の【正気度】が1点以上減少している場合、自分がシーンプレイヤーのときに回復判定以外の主要な行動を行うことができない。");
var c16 = new KyoukiCard("闇からの祝福",
                        "自分が恐怖判定に失敗する。",
                        "　常人ならざる不思議な直感があなたを直撃する。\n　好きなキャラクター一人を選んで、そのキャラクターの【情報】一つを獲得できる（この【情報】の獲得には、情報共有が発生しない）。");
var c17 = new KyoukiCard("多重人格",
                        "自分の【正気度】が減少する。",
                        "　もう一つの人格が囁きかける。\n　ＧＭは、この【狂気】が顕在化したシーンの終了後、マスターシーンを挿入し、自由にこのキャラクターの行動を描写できる。マスターシーンが終了したら、ＧＭはこのキャラクターに対して【感情】を持っているキャラクター一人を選び、その【感情】を好きなものに変更するか、そのキャラクターに2点のダメージを与えることができる。");
var c18 = new KyoukiCard("潔癖",
                        "自分が感情判定の目標になる。",
                        "　他人に触れられるのが怖い！\n　自分が新たに【狂気】を公開するまで、ドラマシーンにアイテムの受け渡しを行うことができなくなる。");
var c19 = new KyoukiCard("恐怖症",
                        "自分が恐怖判定に失敗する。",
                        "　それを見るのも触るのも耐えられない。\n　自分が新たに【狂気】を公開するまで、【恐怖心】に指定されている特技が使用不能になる。");
var c20 = new KyoukiCard("失踪",
                        "自分が判定にファンブルする。もしくは、自分が戦闘で敗者になる。",
                        "　ここは自分のいるべき場所じゃない。\n　この【狂気】が顕在化したシーンが終ってから、2シーンの間、自分がシーンプレイヤーではないシーンに登場することができなくなる(マスターシーンには登場可能)。");
var c21 = new KyoukiCard("異性への恐怖",
                        "そのシーンに、自分が異性のキャラクターと二人きりになる。",
                        "　異性が怖い。あいつらは怪物だ！\n　この【狂気】が顕在化したシーンに登場している異性キャラクターの中から、ランダムにキャラクターを選び、2点のダメージを与える。");
var c22 = new KyoukiCard("暴力衝動",
                        "自分と同じシーンにいるキャラクター（自分も含む）がダメージを受ける。",
                        "　血だ！とにかくお前は誰かを傷つけたい。\n　この【狂気】が顕在化したシーンに登場している好きなＰＣの中から一人を選び、1点のダメージを与える。");
var c23 = new KyoukiCard("狂信者",
                        "誰かが自分に対するマイナスの【感情】を獲得する。",
                        "　運命の出会いが間近に迫っていることを感じる。\n　この【狂気】が顕在化したシーンに登場しているキャラクターの中からランダムに一人を選ぶ。そのキャラクターに対して「狂信」の【感情】を獲得する。以降、「狂信」を持っている相手を攻撃するたび、自分の【正気度】が1点減少する。");
var c24 = new KyoukiCard("超現実主義",
                        "自分が恐怖判定に成功する。",
                        "　あなたは怪異を恐れるあまり、その存在を異常なまでに否定している。\n　自分が新たに【狂気】を公開するまで、怪異からの攻撃に対して回避判定を行うことができなくなる。");
var c25 = new KyoukiCard("陰謀論",
                        "自分が調査判定の目標になる。",
                        "　あなたは何者かに監視されている。この国家的陰謀をみんなに教えなければ……。\n　この【狂気】が顕現化したシーンに登場しているＰＣの中から、ランダムに一人を選び、そのキャタクターの【正気度】が1点減少する。");
var c26 = new KyoukiCard("蛮勇",
                        "自分が戦闘に勝利する。",
                        "　急に強い自信と自負が膨らんでくる。敵に背を見せるなど、負け犬のすることだ！\n　自分が新たに【狂気】を公開するまで、戦闘から自発的に脱落することができなくなる。");
var c27 = new KyoukiCard("頑迷",
                        "同じシーンにいる誰か（自分も含む）がファンブルする。",
                        "　自動車やラジオのような新しい技術に不信感が生まれる。\n　以降、知識分野の特技を指定された判定は、マイナス2の修正がつく。");
var c28 = new KyoukiCard("吸血鬼妄想",
                        "自分と同じシーンにいる自分以外のキャラクターがダメージを受ける。",
                        "　あなたは吸血鬼に憧れている。あのしたたる血潮を舐めとりたい。\n　以降、このキャラクターを感情判定の目標にしたり、このキャラクターが感情判定の目標にしたキャラクターは、【生命力】が1点減少する。");
var c29 = new KyoukiCard("迷信",
                        "自分が怪異に関する恐怖判定を行う。",
                        "　あなたはオカルトに熱狂し、傾倒している。\n　以降、知識分野の特技を指定された判定は、マイナス2の修正がつく。");
var c30 = new KyoukiCard("恐怖の関連付け",
                        "誰かから自分が1点以上ダメージを受ける。",
                        "　あなたは、あなたを傷つける者が怖い。そして、その人物に関連するすべてが怖くなる。\n　そのセッションの間、トリガーを満たしたキャラクターの持つすべての特技が自分の【恐怖心】になる（未公開の【狂気】が四枚以上になったせいで、この【狂気】が公開された場合、ランダムに選んだ特技分野すべての特技が【恐怖心】になる）。");
var c31 = new KyoukiCard("歪んだ心",
                        "誰かが、自分を目標にして調査判定を行い、【秘密】か【精神状態】を獲得する。",
                        "　あなたの精神は恐怖によって歪んでしまった。その歪みを見た者にも、その歪みは伝染するだろう。\n　以降、この【狂気】の持ち主の【秘密】か【精神状態】を獲得したPCは【狂気】を一枚獲得する。");
var c32 = new KyoukiCard("なぜ自分だけ！？",
                        "自分の【生命力】か【正気度】が1点以上減少する。",
                        "　あなたは自分が、これ以上不幸な目にあうことなど考えてもいない。だから自分が不幸な目にあった時、こう思うのだ。「みんなも同じ目にあえばいいのに」と。\n　以降、このキャラクターと同じシーンに登場している、このキャラクター以外のPC全員は、回避判定にマイナス1の修正がつく。");
var c33 = new KyoukiCard("予知夢",
                        "サイクルが終了する。",
                        "　あなたは不思議な夢を見たことを思い出す。その夢の中で、誰かが異常な振る舞いを見せていたが、あれは誰だったのだろうか……？\n　【狂気】の山札の上から五枚目を見て、その中から一枚を獲得する。そして、好きな順番にして山札に戻す。");
var c34 = new KyoukiCard("忌み数",
                        "同じシーンに登場している誰か（自分含む）が行った判定のサイコロの出目に4が含まれている。",
                        "　あなたは4という数字を恐れている。なぜなら四は死に通じているからだ。\n　トリガーを満たしたキャラクターの中からランダムに選んだ一人に2点のダメージを与える（未公開の【狂気】が四枚以上になったせいで、この【狂気】が公開された場合、自分が2点のダメージを受ける）。");
var c35 = new KyoukiCard("誇大妄想",
                        "自分以外の誰かがアイテムかプライズを獲得する。",
                        "　この世の中であなたほど尊いものはない。他のゴミ屑同然の連中が、あなたに優先されることなどありえない！\n　トリガーを満たしたキャラクターの中からランダムに一人を選び、そのアイテムかプライズを奪ったうえで、1点のダメージを与える（未公開の【狂気】が四枚以上になったせいで、この【狂気】が公開された場合、自分が2点のダメージを受ける）。");
var c36 = new KyoukiCard("憑依",
                        "自分が判定でスペシャルかファンブルになる。",
                        "　憑かれたな？　悪魔か狐か犬神か……。あなたは、自分が何者かに憑依されたような心もちになってしまった。\n　この【狂気】が公開されたとき、GMは憑依した存在の名前を決める。自分が新たに【狂気】を公開するまで、GMが決めた名前以外の名前で自分を呼んだキャラクターに1点ダメージを与える。");
var c37 = new KyoukiCard("愚行",
                        "同じシーンに登場している自分以外の誰かが、誰かからプラスの【感情】を持たれる。",
                        "　冷蔵庫に入ってみたら楽しいかな？裸になってみたら驚くかな？　あなたには、ちょっとした悪戯で目立ってみたいという欲求がある。\n　自分の【居所】を、そのセッションに登場するキャラクター全員が獲得し、自分の【正気度】が1点減少する。");
var c38 = new KyoukiCard("奇妙な欲求",
                        "誰かが、自分を目標にして感情判定を行う。",
                        "　あなたには、とても口に出せない欲求がある。あなたが、そんなことをしたいと思っていることを知ったら、ほかのみんなはどんな顔をするだろう？\n　以降、この【狂気】の持ち主の【秘密】か【精神状態】を獲得したPCは、【正気度】が1点減少する。");
var c39 = new KyoukiCard("かんしゃく",
                        "同じシーンにいる誰か（自分も含む）が判定に失敗する。",
                        "　何かイライラする。小さな不満が積み重なり、爆発しそうになる。いらいらいらいら……。\n　自分の持っている好きなアイテム一つを消費する。アイテムを消費できない場合、自分が1点のダメージを受ける。");
var c40 = new KyoukiCard("暴露",
                        "自分に対して誰かがプラスの【感情】を獲得したとき。",
                        "　言ってはいけない。そう思って我慢すればするほど言いたくなってしまう。友人たちの欠点、過去の汚点、とっておきの醜聞……。ああ、しゃべりたい。\n　同じシーンにいる自分に対してプラスの【感情】を持っているキャラクター全員は、「感情表」を使って、その種類を決め直す。このとき、属性は必ずマイナス側になる。");
var c41 = new KyoukiCard("敵か味方か",
                        "自分がダメージを受ける。",
                        "　味方以外は全員敵だ。あなたに好意をしめさない人間は、全員死ね！\n　そのシーンにいる自分に対してプラスの【感情】を持っていないキャラクター全員（自分は除く）に1点のダメージを与える。");
var c42 = new KyoukiCard("既視感",
                        "自分が感情判定に成功する。",
                        "　あなたは、こんな風景を前にも見たことがあるような気がする。あなたは、この先、何が起きるかわかるような気がする。\n　以降、自分が行う調査判定にプラス1の修正がつき自分が行う回避判定にマイナス1の修正がつく。");
var c43 = new KyoukiCard("望郷",
                        "ショックにより自分の【正気度】が減少する。",
                        "　ここは、あなたがいた場所とは違う世界な気がする。親も友人もなぜかあなたが知っている人たちとは別人のような気がする。早くあそこへ帰らないと！\n　以降、回復判定と感情判定のファンブル値が1上昇する。");
var c44 = new KyoukiCard("虚無感",
                        "自分の【生命力】が減少する。",
                        "　どれだけ苦労すれば報われるのだろう？　永遠にこんなことを続けるのだろうか？　あなたは突然、虚無感に襲われる。\n　以降、自分が再挑戦を行うためには、余分に【生命力】か【正気度】を1点消費しなければいけなくなる。");
var c45 = new KyoukiCard("未視感",
                        "自分の【正気度】が減少する。",
                        "　日常見なれたもののはずの道具だが、その使い方が分からない。これ、どう使うんだっけ？\n　自分が新たに【狂気】を公開するまで、アイテムを使用したり、消費したりできなくなる（【依存】の【狂気】を公開している場合、「鎮痛剤」を持っていればそれを使用するが、特に効果はない）。");
var c = new KyoukiCard("",
                        "",
                        "");

var cl1Arr = [c0, c1, c2, c3, c4, c5, c6, c7, c8, c9, c10, c11, c12, c13, c14, c15, c16, c17, c18, c19, c20, c21, c22, c23, c24, c25, c26, c27, c28, c29];  //基本ルルブのKyoukiCardオブジェクト
var cl2Arr = [c30, c31, c32, c33, c34, c35, c36, c37, c38, c39, c40, c41, c42, c43, c44, c45];  //デッドループのKyoukiCardオブジェクト
